Autodesk.Revit.DB.BuiltInFailures.RenderFailures.RenderLibNotInstalledWarn
Rendering library has not been installed, so the third party geometry cannot be created.

Autodesk.Revit.DB.BuiltInFailures.RenderFailures.ProhibitDeletionLightSource
The light source cannot be deleted with UI.

Autodesk.Revit.DB.BuiltInFailures.RenderFailures.LightSourceInsideGeometry
Light source is inside solid geometry. No light will be emitted during rendering.

Autodesk.Revit.DB.BuiltInFailures.RenderFailures.LightParametersNotInRange
The value should be in range of [Value] and [Value].

Autodesk.Revit.DB.BuiltInFailures.RenderFailures
Failures related to rendering.